% База даних
% Кожен рядок містить назву компонента та його характеристики
component('процесор', 'Intel Core i5', 'Тактова частота: 3.2 ГГц, Кількість ядер: 4').
component('материнська плата', 'Asus Prime B450M', 'Ціна: 80 доларів, Кількість роз\'ємів оперативної пам\'яті: 4').
component('оперативна пам\'ять', 'Kingston HyperX Fury', 'Об\'єм: 16 ГБ, Частота: 2.0 ГГц').
component('накопичувач', 'Samsung 970 EVO', 'Об\'єм: 500 ГБ, Швидкість читання/запису: 3.4/3.3 Гб/с').
component('відеокарта', 'Nvidia GeForce GTX 1660', 'Об\'єм пам\'яті: 6 ГБ, Кількість вентиляторів: 1').
component('живлення', 'Corsair CX450M', 'Потужність: 450 Вт, Кількість роз\'ємів живлення: 1').
component('корпус', 'Aerocool Cylon Mini', 'Ціна: 40 доларів, Кількість вентиляторів: 1').
